# Description Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revision..::..Description Property
Revision Class See Also
---
The description of this Revision.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Description { get; set; }
```

Visual Basic
---
```text
Public Property Description As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This operation cannot be performed on Revisions that have already been issued. |

# See Also
Revision Class
Autodesk.Revit.DB Namespace